course_database/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Javascript 101"], ["release_date", "2022-12-22"], ["created_at", "2021-12-10 01:15:27.695953"], ["updated_at", "2021-12-10 01:15:27.695953"]]
---
  def create
    @course = Course.new(course_params)

    if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @course = Course.find_by(id: params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "name" = $1, "release_date" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["name", "Javascript 101 (New Date)"], ["release_date", "2022-12-23"], ["updated_at", "2021-12-10 01:17:40.702890"], ["id", 1]]
---
  def update
    @course = Course.find_by(id: params[:id])

    if @course.nil?
      render json: ["Course does not exist."], status: 404
    elsif @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 2]]
---
  def destroy
    @course = Course.find_by(id: params[:id])
    if @course
      @course.destroy